In [8]:
import pymongo

In [12]:
from pymongo import MongoClient

In [68]:
client = MongoClient()

In [165]:
db = client['virtual_library']

In [166]:
db

Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'virtual_library')

In [167]:
db.checkout

Collection(Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'virtual_library'), 'checkout')

In [168]:
import pandas as pd

In [ ]:
## VISUALIZE EXISTING DATA COLLECTIONS VIA PANDAS

In [259]:
py_checkout = pd.DataFrame(list(db.checkout.find()))
py_checkout.head(10)

,_id,checkout_id,user_id,name,book_id,title,topics,checkout_date,uni
0,5ea34be512ec5b38acf68b49,1,3,Darth Vader,984566781,Machine Learning with R,Machine Learning,2019-03-03 04:00:00,Bogazici
1,5ea34be512ec5b38acf68b4a,2,2,Tarkan,984566781,Machine Learning with R,Machine Learning,2019-08-08 04:00:00,Columbia
2,5ea34be512ec5b38acf68b4b,3,5,Legolas,984566781,Machine Learning with R,Machine Learning,2019-02-02 04:00:00,Georgetown
3,5ea34be512ec5b38acf68b4c,4,5,Legolas,123456789,Chess,Fiction,2019-04-08 04:00:00,Georgetown
4,5ea34be512ec5b38acf68b4d,5,3,Darth Vader,444313722,War and Peace,Fiction,2019-11-11 04:00:00,Bogazici

In [260]:
py_e_books = pd.DataFrame(list(db.e_books.find()))
py_e_books.head(10)

,_id,book_id,title,primary_author,date_of_publication,number_pages,publisher,translator,fiction,topics
0,5e874a1c7a27740dc0a5b5e9,123456789,Chess,Stefan Zweig,2016-04-06 04:00:00,128,Columbia,True,True,fiction
1,5e874a1c7a27740dc0a5b5ea,984566781,Machine Learning with R,Diego Maradona,2001-03-03 04:00:00,541,Xzatz,True,False,"[Machine Learning, Statistics, R]"
2,5e874a1c7a27740dc0a5b5eb,444313722,War and Peace,Lev Tolstoy,1955-07-01 04:00:00,771,Kremlin,True,True,fiction

In [261]:
py_users = pd.DataFrame(list(db.users.find()))
py_users.head(10)

,_id,user_id,name,phone,address,university_affil
0,5e874db97a27740dc0a5b5ec,1,Micheal Jackson,3251711000,113th W 525,Columbia
1,5e874db97a27740dc0a5b5ed,2,Tarkan,2151374000,101th W 403,Columbia
2,5e874db97a27740dc0a5b5ee,3,Darth Vader,4544734000,108th E 203,Bogazici
3,5e874db97a27740dc0a5b5ef,4,Obi Wan Kenobi,7852743000,81th W 45,North Carolina
4,5e874db97a27740dc0a5b5f0,5,Legolas,9843723100,45th E 55,Georgetown

In [58]:
## MODIFY "CHECKOUT" COLLECTION BY ADDING A "REVIEW" COLUMN

In [262]:
db.checkout.update_many({}, {"$set": {"review":["review1","review2","review3"]}}, upsert=False, array_filters=None)

In [263]:
myquery = { "checkout_id" :1}
newvalues = { "$set": { "review":["informative","insightful","concise"] } }
db.checkout.update_many(myquery, newvalues)

In [264]:
myquery = { "checkout_id" :2}
newvalues = { "$set": { "review":["detailed","visual","informative"] } }
db.checkout.update_many(myquery, newvalues)

In [265]:
myquery = { "checkout_id" :3}
newvalues = { "$set": { "review":["instructive","exciting","clear"] } }
db.checkout.update_many(myquery, newvalues)

In [266]:
myquery = { "checkout_id" :4}
newvalues = { "$set": { "review":["thrilling","fantastic","lots of twists!"] } }
db.checkout.update_many(myquery, newvalues)

In [267]:
myquery = { "checkout_id" :5}
newvalues = { "$set": { "review":["romantic","sentimental","historic"] } }
db.checkout.update_many(myquery, newvalues)

In [268]:
## Observe the checkout collection after modifications (reviews are successfuly inserted)
py_checkout = pd.DataFrame(list(db.checkout.find()))
py_checkout.head(10)

,_id,checkout_id,user_id,name,book_id,title,topics,checkout_date,uni,review
0,5ea34be512ec5b38acf68b49,1,3,Darth Vader,984566781,Machine Learning with R,Machine Learning,2019-03-03 04:00:00,Bogazici,"[informative, insightful, concise]"
1,5ea34be512ec5b38acf68b4a,2,2,Tarkan,984566781,Machine Learning with R,Machine Learning,2019-08-08 04:00:00,Columbia,"[detailed, visual, informative]"
2,5ea34be512ec5b38acf68b4b,3,5,Legolas,984566781,Machine Learning with R,Machine Learning,2019-02-02 04:00:00,Georgetown,"[instructive, exciting, clear]"
3,5ea34be512ec5b38acf68b4c,4,5,Legolas,123456789,Chess,Fiction,2019-04-08 04:00:00,Georgetown,"[thrilling, fantastic, lots of twists!]"
4,5ea34be512ec5b38acf68b4d,5,3,Darth Vader,444313722,War and Peace,Fiction,2019-11-11 04:00:00,Bogazici,"[romantic, sentimental, historic]"

In [216]:
 ## QUERIES WITH PANDAS

In [269]:
## Which books have been checked out since such and such date
py_checkout[(py_checkout.checkout_date <='2019-06-13 15:33') & (py_checkout.checkout_date >= '2019-01-01 13:44')]['title']

0    Machine Learning with R
2    Machine Learning with R
3                      Chess
Name: title, dtype: object

In [270]:
## Which users have checked out such and such book
py_checkout[(py_checkout.title == 'Chess') | (py_checkout.title == 'War and Peace')]['name']

3        Legolas
4    Darth Vader
Name: name, dtype: object

In [271]:
## How many books does the library have on such and such topic
py_checkout[(py_checkout.topics == 'Machine Learning') | (py_checkout.topics == 'Fiction')]['book_id'].nunique()

3

In [272]:
## Which users from Columbia University have checked out books on Machine Learning between this date and that date?
py_checkout[(py_checkout.checkout_date <='2019-10-13 15:33') & 
            (py_checkout.checkout_date >= '2019-01-01 13:44') & (py_checkout.uni == 'Columbia')]['name']

1    Tarkan
Name: name, dtype: object

In [273]:
## What comments have been made by any User about such and such book between such and such dates,
## ordered from the most recent to the least recent?
py_checkout[(py_checkout.checkout_date <='2019-11-13 15:33') & 
            (py_checkout.checkout_date >= '2019-01-01 13:44') & 
            ((py_checkout.uni == 'Columbia') | (py_checkout.uni == 'Georgetown'))
           ][['review','checkout_date']].sort_values(by='checkout_date', ascending=False)

                                    review       checkout_date
1          [detailed, visual, informative] 2019-08-08 04:00:00
3  [thrilling, fantastic, lots of twists!] 2019-04-08 04:00:00
2           [instructive, exciting, clear] 2019-02-02 04:00:00

In [275]:
## Show for a given User, what comments they have made about such and such book.
py_checkout[(py_checkout.name == 'Darth Vader')][['title','review']]

                     title                              review
0  Machine Learning with R  [informative, insightful, concise]
4            War and Peace   [romantic, sentimental, historic]